# ElementId Constructor (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
ElementId Constructor
ElementId Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementId(Int32) | Create an ElementId handle with the given integer id. |
| ElementId(BuiltInCategory) | Create an ElementId handle with the given BuiltInCategory id. |
| ElementId(BuiltInParameter) | Create an ElementId handle with the given BuiltInParameter id. |

# See Also
ElementId Class
ElementId Members
Autodesk.Revit.DB Namespace